# Data Wrangling

In [1]:
import pandas as pd
import numpy as np
%matplotlib inline

## Merge

In [2]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})
df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [5]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [11]:
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data':range(7)})
df4 = pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})
df3

   data lkey
0     0    b
1     1    b
2     2    a
3     3    c
4     4    a
5     5    a
6     6    b

In [12]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [14]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

   data lkey  data2 rkey
0     0    b      1    b
1     1    b      1    b
2     6    b      1    b
3     2    a      0    a
4     4    a      0    a
5     5    a      0    a

In [15]:
pd.merge(df1,df2,how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [16]:
pd.merge(df1,df2,how='left')

   data1 key  data2
0      0   b      1
1      1   b      1
2      2   a      0
3      3   c    NaN
4      4   a      0
5      5   a      0
6      6   b      1

In [17]:
left=pd.DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})
right = pd.DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [19]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [20]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [21]:
pd.merge(left,right,on=['key1','key2'],how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [22]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [23]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [24]:
pd.merge(left,right,on='key1',suffixes=['_left','right'])

  key1 key2_left  lval key2right  rval
0  foo       one     1       one     4
1  foo       one     1       one     5
2  foo       two     2       one     4
3  foo       two     2       one     5
4  bar       one     3       one     6
5  bar       one     3       two     7

## Merging on index

In [11]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'values':range(6)})
right1 = pd.DataFrame( { 'group_val' :[3.5,7]} , index=['a','b'] )

In [12]:
left1

  key  values
0   a       0
1   b       1
2   a       2
3   a       3
4   b       4
5   c       5

In [13]:
right1

   group_val
a        3.5
b        7.0

In [17]:
pd.merge(left1,right1,left_on='key',right_index =True,how='outer')

  key  values  group_val
0   a       0        3.5
2   a       2        3.5
3   a       3        3.5
1   b       1        7.0
4   b       4        7.0
5   c       5        NaN

In [43]:
lefth = pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape(6,2),
                     index = [['Nevada','Nevada','Ohio','Ohio',"Ohio",'Ohio'],                                          
                                    [2001,2000,2000,2000,2001,2002] ],
                     columns = ['event1','event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [44]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [45]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [46]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [47]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True,how ='outer')

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1
4     4  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000       2       3

In [50]:
left2 = pd.DataFrame([[7.,8.],[3.,4.],[5.,6.]] ,index = ['a','c','e'],
                    columns = ['Ohio','Nevada'])
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],
                     index =['b','c','d','e'],columns = ['Missouri','Alabama'])
left2

   Ohio  Nevada
a     7       8
c     3       4
e     5       6

In [51]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [52]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     7       8       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [55]:
left2.join(right2,how='left')

   Ohio  Nevada  Missouri  Alabama
a     7       8       NaN      NaN
c     3       4         9       10
e     5       6        13       14

In [58]:
another =pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                     index = ['a','c','e','f'],columns=['New York','Oregon'])

another

   New York  Oregon
a         7       8
c         9      10
e        11      12
f        16      17

In [60]:
left2.join([right2,another],how='inner')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
c     3       4         9       10         9      10
e     5       6        13       14        11      12

## Concatenating Along an Axis

In [61]:
arr = np.arange(12).reshape(3,4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [63]:
np.concatenate([arr,arr],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [72]:
s1 = pd.Series([0,1],index=['a','b'])
s2 = pd.Series([2,3,4],index=['a','d','e'])
s3 = pd.Series([5,6],index=['f','g'])
s1,s2,s3

(a    0
 b    1
 dtype: int64, a    2
 d    3
 e    4
 dtype: int64, f    5
 g    6
 dtype: int64)

In [73]:
pd.concat([s1,s2,s3])

a    0
b    1
a    2
d    3
e    4
f    5
g    6
dtype: int64

In [74]:
pd.concat([s1,s2,s3],axis=1)

    0   1   2
a   0   2 NaN
b   1 NaN NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [79]:
s4 = pd.concat([s1*5,s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [81]:
pd.concat([s1,s4],axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [82]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  5

In [85]:
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']])

    0   1
a   0   0
c NaN NaN
b   1   5
e NaN NaN

In [86]:
result = pd.concat([s1,s2,s3],keys=['one','two','three'])
result

one    a    0
       b    1
two    a    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [89]:
result.unstack()

        a   b   d   e   f   g
one     0   1 NaN NaN NaN NaN
two     2 NaN   3   4 NaN NaN
three NaN NaN NaN NaN   5   6

In [90]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

   one  two  three
a    0    2    NaN
b    1  NaN    NaN
d  NaN    3    NaN
e  NaN    4    NaN
f  NaN  NaN      5
g  NaN  NaN      6

In [91]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'],
                  columns=['one','two'])
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],
                  columns=['three','four'])

In [92]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [93]:
df2

   three  four
a      5     6
c      7     8

In [94]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1      5    6
b          2   3    NaN  NaN
c          4   5      7    8

In [95]:
df1.join(df2,how='outer')

   one  two  three  four
a    0    1      5     6
b    2    3    NaN   NaN
c    4    5      7     8

In [96]:

df1= pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['b','d','a'])
df1

          a         b         c         d
0 -0.786730  0.874956  0.223110 -0.688780
1  1.200762 -1.108428 -0.254699 -2.572169
2  0.302991  1.400876 -0.535565 -0.830171

In [97]:
df2

          b         d         a
0  1.507910  0.538936 -0.078234
1 -0.039379  0.046671  0.383749

In [99]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0 -0.786730  0.874956  0.223110 -0.688780
1  1.200762 -1.108428 -0.254699 -2.572169
2  0.302991  1.400876 -0.535565 -0.830171
3 -0.078234  1.507910       NaN  0.538936
4  0.383749 -0.039379       NaN  0.046671

## Combining Data with Overlap

????????????????????

In [103]:
a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
             index = ['f','e','d','c','b','a'])
b = pd.Series(np.arange(len(a),dtype=np.float64),
             index = ['f','e','d','c','b','a'])
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [107]:
b

f    0
e    1
d    2
c    3
b    4
a    5
dtype: float64

In [115]:
np.where(pd.isnull(a),b,a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  5. ])

In [139]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [141]:
df1 = pd.DataFrame({'a':[1,np.nan,5,np.nan],
                    'b':[np.nan,2.,np.nan,6.],
                   'c': range(2,18,4)})
df2 = pd.DataFrame({'a':[5.,4.,np.nan,3.,7.],
                   'b':[np.nan,3.,4.,6.,8.]})

In [144]:
df1.combine_first(df2)

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

## Reshaping with Hierachical Indexing

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index = pd.Index(['Ohio','Colorado'],name='state'),
                   columns = pd.Index(['one','two','three'],name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [4]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [11]:
result['Ohio']

number
one      0
two      1
three    2
dtype: int64

In [6]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [14]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [15]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [16]:
result.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [17]:
s1 = pd.Series([0,1,2,3],index=['a','b','c','d'])
s2 = pd.Series([4,5,6],index=['c','d','e'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [18]:
s2

c    4
d    5
e    6
dtype: int64

In [19]:
data2 = pd.concat([s1,s2],keys=['one','two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [22]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [23]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64

In [24]:
data2.unstack().stack(dropna=False)

one  a     0
     b     1
     c     2
     d     3
     e   NaN
two  a   NaN
     b   NaN
     c     4
     d     5
     e     6
dtype: float64

In [27]:
df = pd.DataFrame({'left':result,'right':result+5},
                     columns=pd.Index(['left','right'],name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [30]:
df2 = pd.DataFrame({'left':result})
df2

                 left
state    number
Ohio     one        0
         two        1
         three      2
Colorado one        3
         two        4
         three      5

In [31]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [35]:
df.index.levels

FrozenList([[u'Ohio', u'Colorado'], [u'one', u'two', u'three']])

In [38]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

# Data Transformation

In [41]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                     'k2':[1,1,2,2,3,3,3]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   2
4  two   3
5  two   3
6  two   3

In [42]:
data.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   2
4  two   3

In [44]:
data['v1'] =range(7)

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   2   3

In [48]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   2   3
4  two   3   4

## Transformation Data Using a Function or Mapping

In [49]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami',
                             'corned beef','Bacon','pastrami','honey ham',
                            'nova lox'],
                    'ounce':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounce
0        bacon    4.0
1  pulled pork    3.0
2        bacon   12.0
3     Pastrami    6.0
4  corned beef    7.5
5        Bacon    8.0
6     pastrami    3.0
7    honey ham    5.0
8     nova lox    6.0

In [52]:
meat_to_animal = {'bacon':'pig',
                  'pulled pork':'pig',
                 'pastrami':'cow',
                 'corned beef':'cow',
                 'honey ham':'pig',
                 'nova lox':'salmon'}
data['food'].map(str.lower).map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [53]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [54]:
data

          food  ounce  animal
0        bacon    4.0     pig
1  pulled pork    3.0     pig
2        bacon   12.0     pig
3     Pastrami    6.0     cow
4  corned beef    7.5     cow
5        Bacon    8.0     pig
6     pastrami    3.0     cow
7    honey ham    5.0     pig
8     nova lox    6.0  salmon

In [58]:
data['food'].map(lambda xx:meat_to_animal[xx.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [64]:
data['food'].apply(lambda xx:meat_to_animal[xx.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing values